//#include <iostream>
//#include <string>
//
//using namespace std;
//// 公有继承
//// 保护继承
//// 私有继承
//
//class Base1
//{
//public:
//	int _a;
//protected:
//	int _b;
//private:
//	int _c;
//};
//
//class Son1 :public Base1
//{
//public:
//	void func()
//	{
//		_a = 10; // 父类中的公共权限成员，在子类中还是公共权限
//		_b = 10; // 父类中的保护权限成员，在子类中还是保护权限
//		//_c = 10; 父类中的私有权限成员 子类访问不到
//	}
//};
//
//void test01()
//{
//	Son1 s1;
//	s1._a = 100;
//	//s1._b = 10; // 在Son1中为保护权限，类外访问不到
//}
//
//// 保护继承
//class Son2 : protected Base1
//{
//	void func()
//	{
//		_a = 10; // 父类中的公共权限成员，在子类中是保护权限
//		_b = 10; // 父类中的保护权限成员，在子类中是保护权限
//		//_c = 10; // 父类中的私有权限成员 子类访问不到
//	}
//};
//
//void test02()
//{
//	Son2 s2;
//	//s2._a;  // 在Son2中为保护权限，类外访问不到
//	//s2._b;	// 在Son2中为保护权限，类外访问不到
//}
//
//// 私有继承
//class Son3 : private Base1
//{
//	void func()
//	{
//		_a = 10;	// 父类中的公共权限成员，在子类中是私有权限
//		_b = 10;	// 父类中的保护权限成员，在子类中是私有权限
//		//_c = 10; // 父类中的私有权限成员 子类访问不到
//	}
//};
//
//void test03()
//{
//	Son3 s3;
//	//s3._a; // 在Son3中为私有权限，类外访问不到
//	//s3._b; // 在Son3中为私有权限，类外访问不到
//}
//int main()
//{
//
//	return 0;
//}